In [1]:
import numpy as np
import pandas as pd

# 7.1 处理缺失值

In [2]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 7.1 过滤缺失值

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1,NA,3.5,NA,7])

In [8]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))

In [20]:
df.iloc[:4,1]=NA

In [21]:
df.iloc[:2,2]=NA

In [22]:
df

          0         1         2
0  0.015397       NaN       NaN
1  0.578525       NaN       NaN
2  0.834857       NaN -0.606480
3 -0.485085       NaN  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [23]:
df.dropna()

          0         1         2
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [24]:
df.dropna(thresh=2)

          0         1         2
2  0.834857       NaN -0.606480
3 -0.485085       NaN  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [25]:
df.dropna(thresh=3)

          0         1         2
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

## 7.1.2 补全缺失值

In [26]:
df.fillna(0)

          0         1         2
0  0.015397  0.000000  0.000000
1  0.578525  0.000000  0.000000
2  0.834857  0.000000 -0.606480
3 -0.485085  0.000000  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [27]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.015397  0.500000  0.000000
1  0.578525  0.500000  0.000000
2  0.834857  0.500000 -0.606480
3 -0.485085  0.500000  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [28]:
df

          0         1         2
0  0.015397       NaN       NaN
1  0.578525       NaN       NaN
2  0.834857       NaN -0.606480
3 -0.485085       NaN  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [30]:
df1 = df.fillna(0,inplace=True)

In [31]:
df

          0         1         2
0  0.015397  0.000000  0.000000
1  0.578525  0.000000  0.000000
2  0.834857  0.000000 -0.606480
3 -0.485085  0.000000  0.922687
4 -0.617788  1.298151 -1.070514
5 -1.184269  0.533475 -1.573069
6  0.417119  0.324932  0.634631

In [32]:
df = pd.DataFrame(np.random.randn(6,3))

In [33]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [34]:
df

          0         1         2
0  0.278032 -1.494698  0.374278
1  0.095076 -1.958522 -1.690365
2 -0.287491       NaN -1.543025
3 -0.093528       NaN  0.153685
4 -0.149696       NaN       NaN
5  0.512586       NaN       NaN

In [35]:
df.fillna(method='ffill')

          0         1         2
0  0.278032 -1.494698  0.374278
1  0.095076 -1.958522 -1.690365
2 -0.287491 -1.958522 -1.543025
3 -0.093528 -1.958522  0.153685
4 -0.149696 -1.958522  0.153685
5  0.512586 -1.958522  0.153685

In [36]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.278032 -1.494698  0.374278
1  0.095076 -1.958522 -1.690365
2 -0.287491 -1.958522 -1.543025
3 -0.093528 -1.958522  0.153685
4 -0.149696       NaN  0.153685
5  0.512586       NaN  0.153685

In [37]:
data = pd.Series([1.,NA,3.5,NA,7])

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 数据转换

## 7.2.1 删除重复值

In [40]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [41]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)

In [45]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 7.2.2 使用函数或映射进行数据转换

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [56]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [57]:
data['animal']=lowercased.map(meat_to_animal)

In [58]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 7.2.3 替代值

In [61]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [64]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 7.2.4 重命名轴索引

In [66]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [67]:
transform = lambda x: x[:4].upper()

In [68]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [69]:
data.index=data.index.map(transform)

In [70]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [71]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [72]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [73]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 7.2.5 离散化和分箱

In [74]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [75]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [77]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [78]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [80]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [81]:
pd.cut(ages,[18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [82]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [83]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.087, 0.29], (0.7, 0.91], (0.087, 0.29], (0.29, 0.5], (0.5, 0.7], ..., (0.29, 0.5], (0.7, 0.91], (0.29, 0.5], (0.29, 0.5], (0.29, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.087, 0.29] < (0.29, 0.5] < (0.5, 0.7] < (0.7, 0.91]]

In [85]:
data = np.random.randn(1000)

In [86]:
cats = pd.qcut(data, 4)
cats

[(-0.616, 0.0855], (0.743, 2.956], (0.0855, 0.743], (0.0855, 0.743], (-0.616, 0.0855], ..., (0.0855, 0.743], (0.743, 2.956], (-3.416, -0.616], (0.743, 2.956], (-3.416, -0.616]]
Length: 1000
Categories (4, interval[float64]): [(-3.416, -0.616] < (-0.616, 0.0855] < (0.0855, 0.743] < (0.743, 2.956]]

In [87]:
pd.value_counts(cats)

(0.743, 2.956]      250
(0.0855, 0.743]     250
(-0.616, 0.0855]    250
(-3.416, -0.616]    250
dtype: int64

In [88]:
cats2 = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [89]:
cats2

[(-1.277, 0.0855], (0.0855, 1.344], (0.0855, 1.344], (0.0855, 1.344], (-1.277, 0.0855], ..., (0.0855, 1.344], (1.344, 2.956], (-1.277, 0.0855], (1.344, 2.956], (-1.277, 0.0855]]
Length: 1000
Categories (4, interval[float64]): [(-3.416, -1.277] < (-1.277, 0.0855] < (0.0855, 1.344] < (1.344, 2.956]]

In [90]:
pd.value_counts(cats2)

(0.0855, 1.344]     400
(-1.277, 0.0855]    400
(1.344, 2.956]      100
(-3.416, -1.277]    100
dtype: int64

## 7.2.6 异常值

In [91]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017129    -0.001218     0.027964    -0.026933
std       0.971682     0.985208     1.019490     1.026540
min      -2.964171    -3.446429    -3.252852    -3.135790
25%      -0.621101    -0.658422    -0.663483    -0.713519
50%       0.056998    -0.024151     0.076980    -0.038299
75%       0.674266     0.648837     0.740317     0.638793
max       3.401309     3.151267     3.412060     3.576196

In [92]:
col = data[2]

In [93]:
col[np.abs(col)>3]

187    3.184231
248    3.412060
380    3.206145
474   -3.252852
Name: 2, dtype: float64

In [94]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
11  -0.489109  3.151267  0.173721 -0.320385
186  2.051527 -3.093049 -0.534149  1.162108
187  2.045185  0.429022  3.184231 -1.326580
248  0.654263  0.657348  3.412060 -1.082630
301  3.343709  0.165595  0.855251 -0.783654
358  3.401309 -0.698899 -0.793613  0.181549
380 -0.073567 -1.374253  3.206145 -0.078067
421  0.304187 -0.365775  0.411230 -3.135790
442  0.539426 -0.988179  0.302662  3.057859
474  2.139421  0.156236 -3.252852  0.504468
536  3.360248 -2.250281 -2.022644 -1.206430
693 -0.843427  1.485995  0.041573  3.336352
747  0.021673 -3.446429  0.913439  1.324256
827 -0.621544 -0.506179 -2.019851  3.576196

In [95]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016024    -0.000830     0.027414    -0.027768
std       0.968067     0.982983     1.016239     1.023048
min      -2.964171    -3.000000    -3.000000    -3.000000
25%      -0.621101    -0.658422    -0.663483    -0.713519
50%       0.056998    -0.024151     0.076980    -0.038299
75%       0.674266     0.648837     0.740317     0.638793
max       3.000000     3.000000     3.000000     3.000000

In [96]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0 -1.0 -1.0

## 7.2.7 置换和随机抽样

In [97]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [98]:
sampler = np.random.permutation(5)
sampler

array([0, 2, 4, 1, 3])

In [99]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [100]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [101]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
4    4
1    7
4    4
1    7
3    6
1    7
1    7
1    7
4    4
dtype: int64

## 7.2.8 计算指标/虚拟变量

In [102]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [103]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [104]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [105]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [106]:
df_with_dummy=df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
# 例子：电影类型

# 7.3 字符串操作

## 7.3.1 字符串对象方法

In [107]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [108]:
pieces = [x.strip() for x in val.split(',')]

In [109]:
pieces

['a', 'b', 'guido']

In [110]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [111]:
'::'.join(pieces)

'a::b::guido'

In [112]:
'guido' in val

True

In [113]:
val.index(',')

1

In [114]:
val.find(':')

-1

In [115]:
val.count(',')

2

In [116]:
val.replace(',', '::')

'a::b::  guido'

In [117]:
val.replace(',', '')

'ab  guido'

## 7.3.2 正则表达式

In [119]:
import re

In [120]:
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [121]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [122]:
regex.findall(text)

['    ', '\t ', '  \t']

## 7.3.3 pandas中的向量化字符串函数

In [124]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [125]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [126]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [128]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

NameError: name 'pattern' is not defined

In [129]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

NameError: name 'pattern' is not defined

In [130]:
matches.str.get(1)

NameError: name 'matches' is not defined

In [131]:
matches.str[0]

NameError: name 'matches' is not defined

In [132]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [133]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

NameError: name 'PREVIOUS_MAX_ROWS' is not defined